DataProcessors/УниверсальныйЖурналОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<DataProcessor>
		<Properties>
			<Name>УниверсальныйЖурналОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДеревоКонфигурации</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Избранное</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрыватьАвтоматически</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УниверсальныйЖурналОбъектов/Ext/ObjectModule.bsl
Процедура ЗаполнитьДеревоЗначений() Экспорт
	ДеревоКонфигурации.Строки.Очистить();
	
	Корень = ДеревоКонфигурации.Строки.Добавить();
	Корень.Имя = Метаданные.Имя;
	Корень.Синоним = Метаданные.Синоним;
	Корень.ИндексКартинки = 0;
	
	Узел = Корень.Строки.Добавить();
	Узел.Имя = "Справочники";
	Узел.Тип = "Справочник";
	Узел.ИндексКартинки = 4;
	ДобавитьОбъектыПоТипу(Узел);
	
	Узел = Корень.Строки.Добавить();
	Узел.Имя = "Документы";
	Узел.Тип = "Документ";
	Узел.ИндексКартинки = 7;
	ДобавитьОбъектыПоТипу(Узел);
	
	Узел = Корень.Строки.Добавить();
	Узел.Имя = "РегистрыНакопления";
	Узел.Тип = "РегистрНакопления";
	Узел.ИндексКартинки = 17;
	ДобавитьОбъектыПоТипу(Узел);
	
КонецПроцедуры

Процедура ДобавитьОбъектыПоТипу(УзелТипа)
	
	Для Каждого МетаОбъект Из Метаданные[УзелТипа.Имя] Цикл
		НовыйУзел = УзелТипа.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйУзел, УзелТипа);
		
		НовыйУзел.Имя = МетаОбъект.Имя;
		НовыйУзел.Синоним = МетаОбъект.Синоним;
		
	КонецЦикла;
	
КонецПроцедуры
